---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetMarkersAndTextSettings
source: html/ae9345e9-d6ce-50d4-7c9c-3f27c7253d88.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetMarkersAndTextSettings Method

Get markers and text settings object from the style.

## Syntax (C#)
```csharp
public AnalysisDisplayMarkersAndTextSettings GetMarkersAndTextSettings()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - markers and text settings were not created with the object.